{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_flat": {"name": "input_flat:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"codes_topk": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1600"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Minimum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_fc1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_fc1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_logits/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_logits/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Min/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_flat", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_fc1/Relu", "op": "_FusedMatMul", "input": ["input_flat", "StatefulPartitionedCall/sae_encoder_export/enc_fc1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sae_encoder_export/enc_fc1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_relu/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sae_encoder_export/enc_fc1/Relu", "StatefulPartitionedCall/sae_encoder_export/enc_logits/MatMul/ReadVariableOp", "StatefulPartitionedCall/sae_encoder_export/enc_logits/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_relu/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_topk/Shape", "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack", "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_1", "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_topk/Minimum/x", "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/TopKV2", "op": "TopKV2", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_relu/Relu", "StatefulPartitionedCall/sae_encoder_export/codes_topk/Minimum"], "attr": {"Tk": {"type": "DT_INT32"}, "sorted": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Min", "op": "Min", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_topk/TopKV2", "StatefulPartitionedCall/sae_encoder_export/codes_topk/Min/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_relu/Relu", "StatefulPartitionedCall/sae_encoder_export/codes_topk/Min"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_topk/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_relu/Relu", "StatefulPartitionedCall/sae_encoder_export/codes_topk/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sae_encoder_export/codes_topk/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Minimum/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_fc1/MatMul/ReadVariableOp", "shape": [784, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_fc1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_logits/MatMul/ReadVariableOp", "shape": [1024, 1600], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/enc_logits/BiasAdd/ReadVariableOp", "shape": [1600], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sae_encoder_export/codes_topk/Min/reduction_indices", "shape": [], "dtype": "int32"}]}]}